## Проектное задание: банковские счета (Lambda Bank)
Выполнил: Михайленко Петр Евгеньевич, 2024г.

### Содержание ###
[1. Техническое задание (постановка задачи)](#1-техническое-задание-постановка-задачи-)\
[2. Описание алгоритма решения задачи](#1-техническое-задание-постановка-задачи-)\
[3. Описание используемых структур данных](#1-техническое-задание-постановка-задачи-)\
[4. Описание пользовательского интерфейса](#1-техническое-задание-постановка-задачи-)\
[5. Распечатка исходного кода (листинг) программы с комментариями](#1-техническое-задание-постановка-задачи-)\
[6. Описание тест-примеров](#1-техническое-задание-постановка-задачи-)\
[7. Результаты работы программы](#1-техническое-задание-постановка-задачи-)\
[8. Список используемых информационных источников.](#8-список-используемых-информационных-источников-)\


### 1. Техническое задание (постановка задачи) ##

#### 1.1. Наименование
Полное наименование системы: Банковские счета\
Условное обозначение системы – программа.

#### 2.2. Основание для разработки
Программный продукт создается на основе личной инициативы и задания.

#### 2.3. Наименование заказчика и разработчика
Заказчик: Московский государственный университет имени М.В. Ломоносова (МГУ), Факультет вычислительной математики и кибернетики (ВМК).\
Разработчик: Михайленко Петр Евгеньевич.

<!-- TODO Check and rewrite 2.4. -->
### 2.4. Назначение и цели разработки

#### 2.4.1. Назначение программного обеспечения
Разработка ПО «Определение размера скидки клиента» является автоматизацией процедуры установления размера скидок на основе нечеткой логики.

#### 2.4.2. Цели создания программного обеспечения
Основной целью создания ПО «Банковские счета» является автоматизация процедуры транзакций банковских счетов пользователя.\
В соответствии с поставленной целью, создаваемая система должна уметь решать следующие задачи:\
- Считывание из файла пользователей и совершенных транзакций;
- Хранение и обработка считанных данных в памяти в виде списков;
- Сохранение списков счетов в файл;
- Учитывать лимиты по счетам: минимальный и максимальный остаток и при отслеживании лимитов, и при проведении транзакций.

### 2.5. Задачи, подлежащие решению
- Исследование предметной области;
- Разработка структуры программы;
- Разработка функциональной модели;
- Разработка алгоритмов и функций;
- Программная реализация;
- Тестирование;
- Разработка документации к программе.

### 2.6. Требования к разработке

#### 2.6.1 Требования к функциональным характеристикам
Программа должна выполнять следующие функции:\

1. Запуск программы;
2. Просмотр меню;
3. Просмотр информации об авторе;
4. Просмотр информации о программе;
5. Взаимодействие с пользователем через командную строку.

#### 2.6.2. Минимальные требования к составу технических средств
- Оперативная память 1 ГБ;
- Жесткий диск 340 МБ;
- Процессор Pentium с частотой 1,3 ГГЦ;
- Видеоадаптер и монитор, способный обеспечить графический режим 1024x768 точек;
- Наличие клавиатуры;
- Наличие манипуляторов (мышь);
- Наличие Интернет-соединения не менее 1 Мбит/с.

#### 2.6.3 Требования к составу программных средств
Для работы программы на компьютере или ноутбуке пользователя требуется:\
- Операционная система: Windows(32/64 Bit) / MAC OS / Linux;
- Интерпретатор: поддерживающий версию Python 3.12 или более свежую;
- Командная строка: CMD / Terminal / IDE PyCharm или Fleet;

#### 2.6.4 Требования к программным компонентам
Основным требованием к программным компонентам является корректное исполнение функций, заявленных в пункте [2.6.1](#261-требования-к-функциональным-характеристикам).

### 2.7. Требования к входным и выходным данным.
Все входные данные вносятся в файлы ACCOUNTS.DAT TRANSACTIONS.DAT в каталоге data.\
Входные данные:

ACCOUNTS.DAT - список пользователей:
- № счёта пользователя;
- ФИО пользователя;
- остаток на счету пользователя;

TRANSACTIONS.DAT - список транзакций:
- дата операции транзакции;
- № счёта пользователя;
- метка операции (D - deposit, внести; W - windraw, снять).

### 2.8. Этапы разработки
Разработка программы выполняется по этапам, представленным в таблице.\
Таблица 1. Этапы разработки\

| № | Наименование этапа и содержание работ | Сроки исполнения |
|---|---------------------------------------|------------------|
| 1 | Разработка и утверждение ТЗ           | Ноябрь 2024 г.   |
| 2 | Исследование предметной области       | Ноябрь 2024 г.   |
| 3 | Разработка структуры                  | Ноябрь 2024 г.   |
| 4 | Создание программы                    | Ноябрь 2024 г.   |
| 5 | Оформление документации               | Ноябрь 2024 г.   |
| 6 | Защита работы                         | Ноябрь 2024 г.   |

### 2.9. Техническая документация, предъявляемая по окончании работы
1. Техническое задание.
2. Листинг программы.
3. Отчет.

### 2.10. Порядок приема работы
Приём и контроль программного изделия осуществляется в соответствие с методикой испытаний.

### 2.11. Дополнительные условия
Данное техническое задание может дополняться и уточняться в установленном порядке.

## 3. Функции программы


A0 - Автоматизация расчета скидки на основе нечетких множеств
А1 - Сведение об авторе
А2 - Сведения о программе
А3 - Расчет скидки
А31 - Ввод данных
А32 - Вычисление размера скидки
А33 - Вывод результата
А4 – Выход

4. Листинг программы
Файл *classes.py*:
"""
# Filename: classes.py

```
class Account:
    ''' суперкласс для банковского счета '''

    def __init__(self, nAccountNo, nCustomerName, nBalance):
        ''' Конструктор '''
        self.__AccountNo = nAccountNo
        self.__CustomerName = nCustomerName
        self.__Balance = nBalance

    def getAccountNo(self):
        ''' получить номер счета '''
        return self.__AccountNo

    def getCustomerName(self):
        ''' получить имя клиента '''
        return self.__CustomerName

    def getBalance(self):
        ''' получить баланс '''
        return self.__Balance

    def setBalance(self, newBalance):
        ''' установить баланс '''
        self.__Balance = newBalance

    def deposit(self, amount):
        ''' внести депозит '''
        self.__Balance = self.__Balance + amount

    def withdraw(self, amount):
        ''' снять деньги '''
        self.__Balance = self.__Balance - amount

    def display(self):
        ''' информация по счету '''
        print("Номер счета:", self.__AccountNo)
        print("Клиент:", self.__CustomerName)
        print("Баланс: ${0:.2f}".format(self.__Balance))


class SavingAccount(Account):  # inheritance
    ''' сохранить '''

    def __init__(self, nAccountNo, nCustomerName, nBalance):
        ''' конструктор '''
        super().__init__(nAccountNo, nCustomerName, nBalance)
        self.__interest = 0.01 / 12

    def display_monthly_statement(self):
        self.setBalance(self.getBalance() * (1 + self.__interest))
        print("Ежемесячная выписка по сберегательному счету ")
        super().display()

class CurrentAccount(Account):
    ''' Аккаунт клиента '''

    def __init__(self, nAccountNo, nCustomerName, nBalance):
        ''' конструктор '''
        super().__init__(nAccountNo, nCustomerName, nBalance)

    def display_monthly_statement(self):
        print("Ежемесячный отчет по текущему счету ")
        super().display()
```

<!--
1. Запустить приведенную программу
2. Добавить в каждый файл 5-8 записей и проверить работу
3. Сохранить счета и пользователей в виде списков
4. Для пользователей сохраненных в виде списков провести 10-15 транзакций различного вида  вывести результат на экран
5. Добавить метод сохранения списка счетов в файл
6. Добавить лимиты по счетам: минимальный и максимальный остаток и при отслеживание лимитов при проведении транзакций
-->

### 8. Список используемых информационных источников ##
[eclass.cmc.msu.ru ― Сервер дистанционного обучения Лаборатории открытых информационных технологий (ОИТ)](https://eclass.cmc.msu.ru)\
[Python.org ― Официальный сайт языка программирования Python](https://docs.python.org/3/tutorial/controlflow.html)